pandas 是一个数据分析的library,是对表格数据的分析

目录:

Series

DataFrame

Index ,reindex and hieriarchical index

Merge Join Concatenate Groupby and Aggregate

Read from csv

随堂案例：bikes routes counts

数据结构Series

构造和初始化Series

Series是一个一维的数据结构

pandas会舒勇0到n作为series的index，但是我们也可以自己指定index

还可以使用dictionary来构造一个Series，因为Series本来就是key value pairs

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [6]:
type([4,'Beijing',2.26,-2265,'Happy birtgday'])

list

In [7]:
pd.Series([4,'Beijing',2.26,-2265,'Happy birtgday'])#初始化

0                 4
1           Beijing
2              2.26
3             -2265
4    Happy birtgday
dtype: object

In [9]:
pd.Series([4,'Beijing',2.26,-2265,'Happy birtgday'],index=['A','B','C','D','E'])#初始化

A                 4
B           Beijing
C              2.26
D             -2265
E    Happy birtgday
dtype: object

In [5]:
cities={'beijing':55000,'shanghai':60000,'shenzhen':50000,'hangzhou':20000,'guangzhou':25000,'suzhou':None}

In [6]:
apts=pd.Series(cities)
apts

beijing      55000.0
shanghai     60000.0
shenzhen     50000.0
hangzhou     20000.0
guangzhou    25000.0
suzhou           NaN
dtype: float64

In [9]:
apts["beijing"]

55000.0

In [12]:
apts[["beijing","shanghai","hangzhou"]]

beijing     55000.0
shanghai    60000.0
hangzhou    20000.0
dtype: float64

In [13]:
apts[apts<50000]

hangzhou     20000.0
guangzhou    25000.0
dtype: float64

In [15]:
less_than_50000=apts<50000
print(less_than_50000)

beijing      False
shanghai     False
shenzhen     False
hangzhou      True
guangzhou     True
suzhou       False
dtype: bool

In [16]:
np.square(apts)

beijing      3.025000e+09
shanghai     3.600000e+09
shenzhen     2.500000e+09
hangzhou     4.000000e+08
guangzhou    6.250000e+08
suzhou                NaN
dtype: float64

In [17]:
apts

beijing      55000.0
shanghai     60000.0
shenzhen     50000.0
hangzhou     20000.0
guangzhou    25000.0
suzhou           NaN
dtype: float64

In [18]:
apts**2#平方

beijing      3.025000e+09
shanghai     3.600000e+09
shenzhen     2.500000e+09
hangzhou     4.000000e+08
guangzhou    6.250000e+08
suzhou                NaN
dtype: float64

In [20]:
apts.notnull()

beijing       True
shanghai      True
shenzhen      True
hangzhou      True
guangzhou     True
suzhou       False
dtype: bool

In [21]:
apts.isnull()

beijing      False
shanghai     False
shenzhen     False
hangzhou     False
guangzhou    False
suzhou        True
dtype: bool

In [5]:
data = {'state': ['beijing', 'shanghai', 'hangzhou', 'guangzhou', 'shenzhen'],'year': [2000, 2001, 2003, 2004, 2005],'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
print(data)

{'state': ['beijing', 'shanghai', 'hangzhou', 'guangzhou', 'shenzhen'], 'year': [2000, 2001, 2003, 2004, 2005], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [26]:
type(data)

dict

In [6]:
pd.DataFrame(data)#直接将字典的格式转化成DataFrame格式数据

       state  year  pop
0    beijing  2000  1.5
1   shanghai  2001  1.7
2   hangzhou  2003  3.6
3  guangzhou  2004  2.4
4   shenzhen  2005  2.9

In [28]:
pd.DataFrame(data,columns=['city','year','population'])

  city  year population
0  NaN  2000        NaN
1  NaN  2001        NaN
2  NaN  2003        NaN
3  NaN  2004        NaN
4  NaN  2005        NaN

In [29]:
data

{'state': ['beijing', 'shanghai', 'hangzhou', 'guangzhou', 'shenzhen'],
 'year': [2000, 2001, 2003, 2004, 2005],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [7]:
fram2=pd.DataFrame(data)

In [32]:
fram2

       state  year  pop
0    beijing  2000  1.5
1   shanghai  2001  1.7
2   hangzhou  2003  3.6
3  guangzhou  2004  2.4
4   shenzhen  2005  2.9

In [33]:
type(fram2)

pandas.core.frame.DataFrame

In [34]:
fram2['state']

0      beijing
1     shanghai
2     hangzhou
3    guangzhou
4     shenzhen
Name: state, dtype: object

In [37]:
type(fram2['state'])

pandas.core.series.Series

In [38]:
fram2.year

0    2000
1    2001
2    2003
3    2004
4    2005
Name: year, dtype: int64

In [39]:
type(fram2.year)

pandas.core.series.Series

In [10]:
fram2.loc[2]

state    hangzhou
year         2003
pop           3.6
Name: 2, dtype: object

In [11]:
fram2

       state  year  pop
0    beijing  2000  1.5
1   shanghai  2001  1.7
2   hangzhou  2003  3.6
3  guangzhou  2004  2.4
4   shenzhen  2005  2.9

In [16]:
fram2['pop'][2]=4.4

d:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [17]:
fram2['pop'][2]

4.4

In [18]:
fram2

       state  year  pop
0    beijing  2000  1.5
1   shanghai  2001  1.7
2   hangzhou  2003  4.4
3  guangzhou  2004  2.4
4   shenzhen  2005  2.9

In [19]:
pd.DataFrame(data,columns=['state','year','pop','det'])

       state  year  pop  det
0    beijing  2000  1.5  NaN
1   shanghai  2001  1.7  NaN
2   hangzhou  2003  3.6  NaN
3  guangzhou  2004  2.4  NaN
4   shenzhen  2005  2.9  NaN

In [20]:
val=pd.Series([200,300,350],index=[2,3,4])

In [23]:
frame3=pd.DataFrame(data,columns=['state','year','pop','det'])
frame3['det']=val#对某一个列进行整体赋值

In [22]:
frame3

       state  year  pop    det
0    beijing  2000  1.5    NaN
1   shanghai  2001  1.7    NaN
2   hangzhou  2003  3.6  200.0
3  guangzhou  2004  2.4  300.0
4   shenzhen  2005  2.9  350.0

In [36]:
frame3.loc[2]

state    hangzhou
year         2003
pop           3.6
det           200
Name: 2, dtype: object

In [38]:
frame3

       state  year  pop    det
0    beijing  2000  1.5    NaN
1   shanghai  2001  1.7    NaN
2   hangzhou  2003  3.6  200.0
3  guangzhou  2004  2.4  300.0
4   shenzhen  2005  2.9  350.0

In [39]:
frame3.loc[1:3]

       state  year  pop    det
1   shanghai  2001  1.7    NaN
2   hangzhou  2003  3.6  200.0
3  guangzhou  2004  2.4  300.0

In [40]:
frame3.values

array([['beijing', 2000, 1.5, nan],
       ['shanghai', 2001, 1.7, nan],
       ['hangzhou', 2003, 3.6, 200.0],
       ['guangzhou', 2004, 2.4, 300.0],
       ['shenzhen', 2005, 2.9, 350.0]], dtype=object)

In [41]:
type(frame3.values)

numpy.ndarray

In [42]:
frame3.

       state  year  pop    det
0    beijing  2000  1.5    NaN
1   shanghai  2001  1.7    NaN
2   hangzhou  2003  3.6  200.0
3  guangzhou  2004  2.4  300.0
4   shenzhen  2005  2.9  350.0

针对index进行切片

In [46]:
obj=pd.Series(range(3),index=['a','b','c'])
index=obj.index
print(index)
type(index)

Index(['a', 'b', 'c'], dtype='object')

pandas.core.indexes.base.Index

In [49]:
index[1]#不支持更改

'b'

In [53]:
index=pd.Index(np.arange(3))
index
obj2=pd.Series([2,5,7],index=index)
print(obj2)

0    2
1    5
2    7
dtype: int64

In [54]:
type(obj2)

pandas.core.series.Series